'''
문제 2: 진짜 3.6.9 게임 (박수 총 횟수 구하기)
아까 풀었던 3.6.9 문제의 '매운맛' 버전입니다. 아까는 '3이 포함된 숫자의 개수'를 구했다면, 이번엔 **'쳐야 하는 총 박수 횟수'**를 구합니다.

문제: 정수 N이 주어집니다. 1부터 N까지 3.6.9 게임을 할 때, 3, 6, 9가 들어간 횟수만큼 박수를 친다면 총 몇 번의 박수를 쳐야 할까요?

입력 예시: 36

출력 예시: 18

예제 설명: 3, 6, 9, 13, 16, 19, 23, 26, 29, 30, 31, 32, 34, 35에서 각각 1번씩 치고 (14번), 33과 36에서는 각각 2번씩 치므로 총 18번입니다.

💡 힌트: 파이썬의 문자열에는 특정 문자의 개수를 세어주는 아주 편한 .count() 기능이 있습니다.
'''

N = int(input())
cnt = 0
for i in range(1, N+1):
    for j in [i]:
        j = str(j)
        if '3' in j:
            cnt += 1
        if '6' in j:
            cnt += 1
        if '9' in j:
            cnt += 1
print(cnt)